In [68]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings("ignore")

#### Pandas
##### Panel - Dataframe - Series
* Panel - Data more than 2 dimension
* Dataframe - Tablelike structure, 2D Data, Matrix
* Series - Array like structure, 1D Data
* These are the three main data structures in pandas.

* Pandas support Numeric and Object datatypes
* Numeric contains - int, int64, float
* Object - String, Characters, Alphanumeric Characters, Symbols, Bits and Bytes

* Pandas is one of the most used data analytical library/module in python.
* Pandas can be work with files, texts, databases, websites and clouds.

In [2]:
arr = np.array(["Sun","Mon","Tue","Wed","Thr","Fri","Sat"])

In [5]:
# How to create pandas series with name

s1 = pd.Series(arr, name="Weekdays")
s1

0    Sun
1    Mon
2    Tue
3    Wed
4    Thr
5    Fri
6    Sat
Name: Weekdays, dtype: object

In [6]:
s1.name

'Weekdays'

In [8]:
s2 = pd.Series([2, 5, 7, 4], name="Number List")
s2

0    2
1    5
2    7
3    4
Name: Number List, dtype: int64

In [10]:
s3 = pd.Series((1,2,3,4,5))
s3

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [14]:
# s4 = pd.Series(np.random.randint(1,26,24).reshape(6,4), name="Random_Numbers")
# We cannot create Series more than 1 Dimension

In [15]:
s3.dtype

dtype('int64')

In [16]:
s3.mean()

3.0

In [18]:
s2.mean()

4.5

In [19]:
s2.std()

2.0816659994661326

In [20]:
s3.std()

1.5811388300841898

In [21]:
d = {
    "Std_Names":["Chandu", "Nandu", "Bandu"],
    "Marks":[67, 59, 46]
}
d

{'Std_Names': ['Chandu', 'Nandu', 'Bandu'], 'Marks': [67, 59, 46]}

In [22]:
df = pd.DataFrame(d)
df

  Std_Names  Marks
0    Chandu     67
1     Nandu     59
2     Bandu     46

In [24]:
arr2 = np.random.randint(35, 99, 24).reshape(6,4)
arr2

array([[88, 67, 49, 77],
       [90, 88, 51, 98],
       [71, 68, 48, 88],
       [84, 97, 55, 82],
       [95, 59, 69, 52],
       [42, 96, 48, 52]])

In [25]:
df2 = pd.DataFrame(arr2)
df2

    0   1   2   3
0  88  67  49  77
1  90  88  51  98
2  71  68  48  88
3  84  97  55  82
4  95  59  69  52
5  42  96  48  52

In [26]:
df3 = pd.DataFrame(arr2, columns=["Math", "English", "Physics", "Sport"])
df3

   Math  English  Physics  Sport
0    88       67       49     77
1    90       88       51     98
2    71       68       48     88
3    84       97       55     82
4    95       59       69     52
5    42       96       48     52

In [27]:
df3["Std_Name"] = ["Sachin", "Rohit", "Virat", "Shubhman", "Ravindra", "Rinku"]

In [28]:
df3

   Math  English  Physics  Sport  Std_Name
0    88       67       49     77    Sachin
1    90       88       51     98     Rohit
2    71       68       48     88     Virat
3    84       97       55     82  Shubhman
4    95       59       69     52  Ravindra
5    42       96       48     52     Rinku

### Question
* Create a dataframe, add new column into it and change the position of column.
* How many ways to do this? (atleast 3)

In [31]:
df3.head(3)   # to return the top 5 rows of dataframe, we can return as many rows by
# giving number in head()

   Math  English  Physics  Sport Std_Name
0    88       67       49     77   Sachin
1    90       88       51     98    Rohit
2    71       68       48     88    Virat

In [32]:
df3.head(2)

   Math  English  Physics  Sport Std_Name
0    88       67       49     77   Sachin
1    90       88       51     98    Rohit

In [33]:
df3.tail()

   Math  English  Physics  Sport  Std_Name
1    90       88       51     98     Rohit
2    71       68       48     88     Virat
3    84       97       55     82  Shubhman
4    95       59       69     52  Ravindra
5    42       96       48     52     Rinku

In [34]:
df3.tail(3)

   Math  English  Physics  Sport  Std_Name
3    84       97       55     82  Shubhman
4    95       59       69     52  Ravindra
5    42       96       48     52     Rinku

In [35]:
df3.iloc[3:5]

   Math  English  Physics  Sport  Std_Name
3    84       97       55     82  Shubhman
4    95       59       69     52  Ravindra

In [39]:
df3.loc[2:4]

   Math  English  Physics  Sport  Std_Name
2    71       68       48     88     Virat
3    84       97       55     82  Shubhman
4    95       59       69     52  Ravindra

In [42]:
type(df3["Math"])

pandas.core.series.Series

In [43]:
df3.iloc[1]

Math           90
English        88
Physics        51
Sport          98
Std_Name    Rohit
Name: 1, dtype: object

In [44]:
df2

    0   1   2   3
0  88  67  49  77
1  90  88  51  98
2  71  68  48  88
3  84  97  55  82
4  95  59  69  52
5  42  96  48  52

In [46]:
df2.iloc[0].mean()

70.25

In [48]:
# What is fancy indexing in python? give atleast 3 examples.

In [50]:
df3[["Math", "English"]]

   Math  English
0    88       67
1    90       88
2    71       68
3    84       97
4    95       59
5    42       96

In [59]:
df3[["Math", "English"]]

   Math  English
0    88       67
1    90       88
2    71       68
3    84       97
4    95       59
5    42       96

In [62]:
df3.drop("Std_Name", axis=1, inplace=True)

In [63]:
df3

   Math  English  Physics  Sport
0    88       67       49     77
1    90       88       51     98
2    71       68       48     88
3    84       97       55     82
4    95       59       69     52
5    42       96       48     52

In [65]:
df4 = pd.read_csv("googleplaystore.csv")
df4.head(3)

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up

In [70]:
df6 = pd.read_excel(r"C:\Users\Admin\Downloads\SampleSuperstore.xlsx")
df6.head(3)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820
2,3,CA-2017-138688,2017-06-12,2017-06-16,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036.0,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.62,2,0.0,6.8714

In [69]:
df5 = pd.read_excel("C:/Users/Admin/Downloads/SampleSuperstore.xlsx")
df5.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2017-152156,2017-11-08,2017-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420.0,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820